

/*
 Свойство elem.scrollTop содержит размер прокрученной области при отсчёте сверху.
А как подсчитать размер прокрутки снизу (назовём его scrollBottom)?
*/


// Напишите код, который возвращает ширину стандартной полосы прокрутки.


// Поместить с помощью JS мячь в центр ворот.
// *картинка должна иметь заданный размер



/*
 Написать код, который будет нивелировать изчезновение полосы прокрутки из документа
после document.body.style.overflow = "hidden"
*/



// Вывести сообщение, спозиционированное относительно произвольно выбранного елемента.


/*
 Используя JS, найти координаты углов прямоугольника id ="field".
 · верхний левый, внешний угол (до границы)
 · нижний правый, внешний угол (за границей)
 · верхний левый, внутренний угол
 · нижний правый, внутренний угол
*/
let topLeft = []; console.log('top left ', topLeft);
let botRight = []; console.log('bot right', botRight);
let topLeftInside = []; console.log('top left Inside', topLeftInside);
let botRightInside = []; console.log('bot right Inside', botRightInside);



/*
 Переместить мяч на то место в поле, где был клик.
 · Центр мяча должен совпадать с местом нажатия мыши;
 · Мяч не должен пересекать границы поля;
 · При прокрутке страницы ничего не должно ломаться;
*/



/*
 Создать меню, которое по нажатию открывается либо закрывается
Сладости:
 · Пирожное
 · Пончик
 · Мёд
*/




// Запустить карусель
const inner = document.querySelector('.inner');



// Дан список сообщений с кнопками для удаления [x]. Заставить кнопки работать.



/*
 Создайте дерево, которое по клику на заголовок скрывает-показывает потомков:
 · Использовать только один обработчик событий (применить делегирование)
 · Клик вне текста заголовка (на пустом месте) ничего делать не должен
* текст из li надо обернуть в span
*/


// Сделать таблицу id="grid" сортируемой.



/*
 При наведении мыши на элемент с атрибутом data-tooltip, над ним должна показываться подсказка 
и скрываться при переходе на другой элемент.
 · Отступ от подсказки до элемента с data-tooltip должен быть 5px по высоте.
 · Подсказка должна быть, по возможности, посередине элемента.
 · Подсказка не должна вылезать за границы экрана, в том числе если страница частично прокручена,
    если нельзя показать сверху – показывать снизу элемента.
 · Текст подсказки брать из значения атрибута data-tooltip. Это может быть произвольный HTML.
*/
let message;


/*
 Сделайте так, чтобы при клике на ссылки внутри элемента id="contents" пользователю выводился вопрос о том,
действительно ли он хочет покинуть страницу, и если он не хочет, то прерывать переход по ссылке.
 Использовать делегирование.
*/


// Создайте галерею изображений, в которой основное изображение изменяется при клике на уменьшенный вариант.


// Дописать к предыдущему заданию рандомный показ картинок(создать пользовательское событие).













