
// Написать функцию ucFirst(str), возвращающую строку str с заглавным первым символом

// Написать функцию проверки на спам. Функция должна возвращать true, если str 
// содержит 'viagra' или 'xxx'. Функция должна быть нечувствительна к регистру.

/*
Создайте функцию truncate(str, maxlength), которая проверяет длину строки str и,
 если она превосходит maxlength, заменяет конец str на "…", так, чтобы её длина стала равна maxlength.
*/


// Создайте функцию extractCurrencyValue(str), которая будет из строки выделять числовое значение
// и возвращать его.
