
// Создать объект с тремя разными свойствами

// Добавить ключ из нескольких слов путём вычисления с переменной

// Создать и добавить символ id с описанием (именем) "id"

// Создать глобальный символ и вывести его имя (не через description)

// Добавить свойство со вложенностью

// Удалить третье свойство

// Изменить первое свойство на undefined

// Скопировать объект в новую переменную "newObj" и добавить свойство "sex".

// Появится ли новое свойство в родительском объекте?

// Продублировать объект "newObj"

// Добавить дублированному объекту значение во вложенности через Object.assign


// Используя цикл вывести в консоль ключи и значения


// Создать объект с функцией, собирающей объект в строку (использовать this)



// Создать функцию-конструктор и вызвать её несколько раз



// Создать калькутятор через prompt



/*
 Вывести в alert() поочерёдно модель и произвольно изменённый год авто
в строковом и числовом значении соответственно.
 Переписать через "toPrimitive".
*/









