// Создайте функцию unique(arr), которая вернёт массив уникальных, не повторяющихся значений массива arr.
let values = ["Hare", "Krishna", "Hare", "Krishna", "Krishna", "Krishna", "Hare", "Hare", ":-O"];


// Напишите функцию anClean(arr), которая возвращает массив слов, очищенный от анаграмм.
let anagArr = ["nap", "teachers", "cheaters", "PAN", "ear", "era", "hectares"];

// =========================== Задачи на Object.keys, values, entries ===========================

//  Напишите функцию sumSalaries(salaries), которая возвращает сумму всех зарплат.
// Решить разными способами.
let salaries = {
   "John": 100,
   "Pete": 300,
   "Mary": 250
};


// Напишите фенкцию, считающую сумму покупок. Решить разными способами.
let recipeMap = new Map([
   ['Помидор', 500],
   ['Огурец', 350],
   ['Лук', 50]
]);


// Напишите функцию count(obj), которая возвращает количество свойств объекта
let user = {
   name: 'John',
   years: 30
};



/*
 У нас есть объект user из задачи выше. Напишите деструктурирующее присваивание, которое:
 1) свойство name присвоит в переменную name.
 2) свойство years присвоит в переменную age.
 3) свойство isAdmin присвоит в переменную isAdmin (false, если нет такого свойства)
*/



/*
 У нас есть объект salaries с зарплатами из задачи выше. Создайте функцию topSalary(salaries),
которая возвращает имя самого высокооплачиваемого сотрудника.
Если объект salaries пустой, то нужно вернуть null.
*/




