
/*
 · Написать класс Cars с методами заправки и расхода топлива у машин.
 · Выводить дату заправки в отдельном массиве.
 · Сеттор должен возвращать реитинг авто в верхнем регистре.
 · Добавить классу статическое свойство saller = 'NevaCars';
 · Добавить унаследованный класс для гибридного авто со статическим методом "discount".
 · Переписать метод расхода топлива для класса гибридного авто, сделав расход топлива меньшим.
*/


/*
 На реальном примере показать работу с классами(html подготовлен).
 · класс Component должем иметь методы для скрытия и появления объекта
 · его дочерний класс Box определяет размер и цвет фигур
 · у класса Box наследует класс Cercle, который делает фигуры круглыми
 · создать три объекта имеющими свойства для определения своего размера и цвета,
 плюс добавить свойство selector для обращения к ним
*/




/*
 Создать класс с расширением свойств внутреннего класса Array.
 · метод должен проверять пустой массив или нет
 · метод не должен распростроняться на дальнейшие результаты преобразований массива
*/


// Сделать проверку, наследует ли объект cercle от класса Component.


/*
 · Написать код, позволяющий пройти проверку на наследственность к определённому классу объектам
со свойством xxx.
 · Дописать объекту символьное свойство, возвращающее тип объекта "[Rock]". Вывести тип в консоль.
*/



// Написать миксин





