
// Записать в сокращённой форме числа:
//  1) 1340000000
//  2) 0.0000012


// Вернуть число 255 в 16иричной и двоичной системе исчисления


// Создайть скрипт, который запрашивает ввод двух чисел (использовать prompt)
//  и после показывает их сумму(alert).


/*
 Создайте функцию readNumber(), которая будет запрашивать ввод числового значения до тех пор,
пока посетитель его не введёт. Функция должна возвращать числовое значение.
 Также надо разрешить пользователю остановить процесс ввода, отправив пустую строку
или нажав «Отмена». В этом случае функция должна вернуть null.
*/


// Написать функцию random(min, max), которая генерирует случайное число с плавающей точкой
// от min до max (но не включая max).


/*
 Напишите функцию randomInteger(min, max), которая генерирует случайное
целое (integer) число от min до max (включительно).
Сделать два варианта. Один через Math.round, другой через Math.floor.
*/

