
/*
 Порядок выполнения задания:
 · создать новую директорию
 · создать в ней фаил app.js
 · создать фаил pacckage.json (npm init)
 · установить библиотеки lodash и axios
 · установить jqery
 · прописать в app.js импорт двух методов из lodash (random и uniq)
 · прописать в app.js импорт библиотеки axios
 · прописать в app.js пример работы этих методов
 · создать index.html и подключить к нему app.js
 · установить webpack-cli и webpack в dev
 · создать webpack.config.js
 · прописать минимальную сборку webpack
 · прописать в package.json два скрипта (для разработки и для продакшина)
 · привязать в inner.html bundle.js взамен app.js  
 · установить babel loader в dev
 · дописать настройки в config для babel (есть в документации npm)
 · создать папку src в головной директории и в неё добавить фаил constans.js
 · в новом фаиле создать константу key и импортировать её в app.js (исп. именованный экспорт)
 · создать константу citiesUrl (ссылка из GitHub "gist.github.com/vasilymur")
 · найти фаил с 1000 городов США, кликнуть на формат Raw и скопировать адресную строку страницы
 · импортировать её в app.js и вывести в log (убедиться в корректности) 
 · используя библиотеку axios получить список американских городов в ноую переменную cities
 · в constans.js создать именованный экспорт функции, которая оставляет только название города и его население
 · использовать эту функцию поместив результат в переменную citiesMapped
 · 
 · 
 · 
 · 
 · 
 · 
 · 
 · 
 · 
 · 
 · 
 · 
 · 
*/
















